#language:ru
@html-plugin
Функционал: Пример использования html-plugin

  @html
  Сценарий: Пример использования html-plugin
    * отвратительный шаг
    * пользователь 2 в системе
    * пользователь находится на странице "Не очень такая страница"
    * отвратительный шаг
    * пользователь находится на странице "Test Automation Gears HTML 2"
    * пользователь в блоке "Не очень такой блок" (выбирает удивительную ветку) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (не очень такой экшн) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (выбирает тестовую ветку) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2" (выбирает удивительную ветку) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (выбирает удивительную ветку) с параметром "ывфыА"
    * пользователь в поразительном блоке "List of repos 2->Обыкновенный блок" (select testing branch) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (select testing branch) с параметром "ывфыА"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (выбирает удивительную ветку) с параметром "List of repos 2"
    * пользователь находится на странице "Test Automation Gears HTML 2"
    * пользователь в блоке "List of repos 2->Обыкновенный блок" (выбирает тестовую ветку) с параметром "ывфыА"
    * пользователь кликает по перекрытому элементу "Темная ссылка - одна ты такая"
    * пользователь находится на странице "Test Automation Gears HTML 2"
    * пользователь кликает по перекрытому элементу "asfsdvsdcs"
    * glop в системах
    * пользователь находится на странице "Example HTML 2"
    * пользователь переходит в приложение "joint"
    * пользователь находится на странице "Glop page"
    * пользователь кликает по перекрытому элементу "Glop link"
    * пользователь кликает по перекрытому элементу ""
    * glop в системе